      * Layout detalhado do arquivo de clientes - Injetado via COPY
       01 FD-REG-CLI.
          05 FD-CLI-CD   PIC 9(005).
          05 FD-CLI-NM   PIC X(030).
          05 FD-CLI-CPF  PIC 9(011).
          05 FD-CLI-SDO  PIC 9(009)V99.
          05 FD-CLI-ST   PIC X(001).