      * Layout detalhado do arquivo de transacoes - Injetado via COPY
       01 FD-REG-TRA.
          05 FD-TRA-ID      PIC 9(006).
          05 FD-TRA-CD-CLI  PIC 9(005).
          05 FD-TRA-TP      PIC X(001).
          05 FD-TRA-VLR     PIC 9(009)V99.
          05 FD-TRA-DT      PIC 9(008).